src/cf/src/Catalogs/ВидыЦен/ВидыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЦен</name>
  <predefined>
    <items>
      <name>Закупочная</name>
      <description>Prix d'achat</description>
    </items>
    <items>
      <name>Розничная</name>
      <description>Prix de vente</description>
    </items>
    <items>
      <name>МинимальнаяЦенаПродажи</name>
      <description>Prix minimal</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическийРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсноваРасчёта</name>
    <type>
      <types>EnumRef.ОсновыРасчётаНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНаценки</name>
    <type>
      <types>EnumRef.ВидыНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Точность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/CommonModules/РаботаСДокументамиКлиентСервер/Module.bsl
#Область Рассчёт_строк_документа

Процедура РассчитатьКоличество(Стр, ПостфиксКоличества = "") Экспорт
	ЕстьКоличествоУпаковок = ЕстьРеквизит(Стр, "КоличествоУпаковок");
	ОсноваРасчёта = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок", "Количество");
	РеквизитКоличество = "Количество" + ПостфиксКоличества;
	РеквизитКоличествоУпаковок = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок" + ПостфиксКоличества, РеквизитКоличество);
	Если ОсноваРасчёта = "КоличествоУпаковок" Тогда // Рассчитаем количество по коэффициенту упаковки
		Если ЗначениеЗаполнено(Стр.Упаковка) Тогда
			Коэффициент = ОбщегоНазначенияВызовСервера.РассчитатьКоэффициентЕдиницы(Стр.Упаковка);
			Стр[РеквизитКоличество] = Стр[РеквизитКоличествоУпаковок] * Коэффициент;
		Иначе
			Стр[РеквизитКоличество] = Стр[РеквизитКоличествоУпаковок];
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Пересчитывает строку табличной части: количество, цену, сумму, скидку и НДС.
//
// Параметры:
//  Стр - СтрокаТабличнойЧасти, ДанныеФормыЭлементКоллекции, Структура - строка с реквизитами Цена, Сумма,
//        СтавкаНДС, СуммаНДС, СуммаСНДС, ПроцентСкидки, СуммаСкидки, СкидкаНаЦену (любой может отсутствовать)
//  ЦенаВключаетНДС - Булево - Истина: Цена и Сумма с НДС; Ложь: Цена и Сумма без НДС, НДС начисляется сверху,
//        процент и сумма скидки считаются от суммы с НДС
//  ОсноваРасчёта - Строка - что ввёл пользователь: "Цена" (цена или скидка на цену), "Сумма" (сумма или сумма
//        скидки), "СуммаНДС" (сумма НДС вручную), "" - количество
//  ПостфиксКоличества - Строка - постфикс имён реквизитов количества (например, "Принято")
//
Процедура РассчитатьСтроку(Стр, ЦенаВключаетНДС = Истина, ОсноваРасчёта = "", ПостфиксКоличества = "") Экспорт
	ЕстьКоличествоУпаковок = ЕстьРеквизит(Стр, "КоличествоУпаковок");
	Если ПустаяСтрока(ОсноваРасчёта) Тогда
		ОсноваРасчёта = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок", "Количество");
	КонецЕсли;
	РеквизитКоличество = "Количество" + ПостфиксКоличества;
	РеквизитКоличествоУпаковок = ?(ЕстьКоличествоУпаковок, "КоличествоУпаковок" + ПостфиксКоличества, РеквизитКоличество);
	РассчитатьКоличество(Стр, ПостфиксКоличества);
	Если Не ЕстьРеквизит(Стр, "Сумма") Тогда Возврат КонецЕсли;
	// Рассчитываем
	ЕстьЦенаSKU = ЕстьРеквизит(Стр, "ЦенаSKU");
	Если ОсноваРасчёта = "Цена" Тогда
		Если ЕстьЦенаSKU Тогда
			Стр.ЦенаSKU = РассчитатьЦену(Стр.Цена, Стр[РеквизитКоличествоУпаковок], Стр[РеквизитКоличество], Ложь);
		КонецЕсли;
		Стр.Сумма = Стр.Цена * Стр[РеквизитКоличествоУпаковок];
	ИначеЕсли ОсноваРасчёта = "Сумма" Тогда
		Стр.Цена = Стр.Сумма / ?(Стр[РеквизитКоличествоУпаковок] = 0, 1, Стр[РеквизитКоличествоУпаковок]);
		Если ЕстьЦенаSKU Тогда
			Стр.ЦенаSKU = РассчитатьЦену(Стр.Цена, Стр[РеквизитКоличествоУпаковок], Стр[РеквизитКоличество], Ложь);
		КонецЕсли;
	ИначеЕсли ОсноваРасчёта = "СуммаНДС" Тогда
		Если Не ЦенаВключаетНДС Тогда
			Стр.СуммаСНДС = Стр.Сумма - СуммаСкидкиБезНДС(Стр, ЦенаВключаетНДС) + Стр.СуммаНДС;
		КонецЕсли;
		Возврат;
	ИначеЕсли ЕстьРеквизит(Стр, "Цена") Тогда
		Если ЕстьЦенаSKU Тогда
			Стр.Цена = РассчитатьЦену(Стр.ЦенаSKU, Стр[РеквизитКоличествоУпаковок], Стр[РеквизитКоличество], Истина);
		КонецЕсли;
		Стр.Сумма = Стр.Цена * Стр[РеквизитКоличествоУпаковок];
	КонецЕсли;
	// Скидка
	СуммаОсноваНДС = Стр.Сумма;
	Если ЕстьРеквизит(Стр, "СуммаСкидки") Тогда
		СуммаБазовая = Стр.Сумма;
		Если Не ЦенаВключаетНДС И ЕстьРеквизит(Стр, "СтавкаНДС") Тогда
			// Цена без НДС: процент и сумма скидки - от суммы с НДС.
			СуммаБазовая = Стр.Сумма + РассчитатьСуммуНДС(Стр.СтавкаНДС, Стр.Сумма, Ложь);
		КонецЕсли;
		РассчитатьСкидку(Стр, ОсноваРасчёта, СуммаБазовая);
		СуммаОсноваНДС = СуммаОсноваНДС - СуммаСкидкиБезНДС(Стр, ЦенаВключаетНДС);
	КонецЕсли;
	// Рассчитываем НДС
	Если ЕстьРеквизит(Стр, "СтавкаНДС") и ЕстьРеквизит(Стр, "СуммаНДС") Тогда
		Стр.СуммаНДС = РассчитатьСуммуНДС(Стр.СтавкаНДС, СуммаОсноваНДС, ЦенаВключаетНДС);
		Если ЕстьРеквизит(Стр, "СуммаСНДС") Тогда
			Стр.СуммаСНДС = СуммаОсноваНДС + ?(ЦенаВключаетНДС, 0, Стр.СуммаНДС);
		КонецЕсли;
	КонецЕсли;
	// Наценка к последней закупочной цене
	Если ЕстьРеквизит(Стр, "ПроцентНаценкиНаЦену") И ЕстьРеквизит(Стр, "ЦенаЗакупкиПоследняя") Тогда
		Стр.ПроцентНаценкиНаЦену = ?(Стр.ЦенаЗакупкиПоследняя = 0, 0,
			(Стр.Цена - Стр.ЦенаЗакупкиПоследняя) / Стр.ЦенаЗакупкиПоследняя * СтоПроцентов());
	КонецЕсли;
КонецПроцедуры

// Скидка строки: процент, сумма (в тех же единицах, что СуммаБазовая) и скидка на цену.
// Введённое пользователем значение (сумма скидки, скидка на цену или процент) сохраняется, остальные считаются от него.
//
// Параметры:
//  Стр - СтрокаТабличнойЧасти, Структура - строка с реквизитами ПроцентСкидки, СуммаСкидки, Цена и, возможно, СкидкаНаЦену.
//  ОсноваРасчета - Строка - что ввёл пользователь: "Сумма" - сумму скидки, "Цена" - скидку на цену, иначе - процент.
//  СуммаБазовая - Число - сумма строки, от которой считается скидка (с НДС или без - по режиму документа).
//
Процедура РассчитатьСкидку(Стр, ОсноваРасчета, СуммаБазовая)
	ЕстьСкидкаНаЦену = ЕстьРеквизит(Стр, "СкидкаНаЦену");
	Если ОсноваРасчета = "Цена" И ЕстьСкидкаНаЦену Тогда
		// Введена скидка на цену (или цена)
		Стр.ПроцентСкидки = ?(Стр.Цена = 0, 0, Стр.СкидкаНаЦену / Стр.Цена * СтоПроцентов());
		Стр.СуммаСкидки = СуммаБазовая / СтоПроцентов() * Стр.ПроцентСкидки;
	ИначеЕсли ОсноваРасчета = "Сумма" Или ОсноваРасчета = "Цена" Тогда
		// Введена сумма скидки (или сумма строки, или цена без реквизита скидки на цену)
		Стр.ПроцентСкидки = ?(СуммаБазовая = 0, 0, Стр.СуммаСкидки / СуммаБазовая * СтоПроцентов());
	Иначе
		Стр.СуммаСкидки = СуммаБазовая / СтоПроцентов() * Стр.ПроцентСкидки;
	КонецЕсли;
	Если ЕстьСкидкаНаЦену И ОсноваРасчета <> "Цена" Тогда
		Стр.СкидкаНаЦену = Стр.Цена / СтоПроцентов() * Стр.ПроцентСкидки;
	КонецЕсли;
КонецПроцедуры

// Сумма скидки без НДС: при цене с НДС - сумма скидки как есть, при цене без НДС - доля суммы без НДС по проценту.
//
// Параметры:
//  Стр - СтрокаТабличнойЧасти, Структура - строка документа.
//  ЦенаВключаетНДС - Булево - режим НДС документа.
//
// Возвращаемое значение:
//  Число - сумма скидки в единицах суммы строки.
//
Функция СуммаСкидкиБезНДС(Стр, ЦенаВключаетНДС)
	Если Не ЕстьРеквизит(Стр, "СуммаСкидки") Тогда
		Возврат 0;
	КонецЕсли;
	Если ЦенаВключаетНДС Или Не ЕстьРеквизит(Стр, "СтавкаНДС") Тогда
		Возврат Стр.СуммаСкидки;
	КонецЕсли;
	Возврат Стр.Сумма / СтоПроцентов() * Стр.ПроцентСкидки;
КонецФункции

// Сто процентов - база процентных расчётов.
//
// Возвращаемое значение:
//  Число - 100.
//
Функция СтоПроцентов() Экспорт
	Возврат 100;
КонецФункции

Функция РассчитатьЦену(Цена, КоличествоУпаковок, Количество, ОтЦеныSKU)
	Коэффициент = ?(КоличествоУпаковок = 0, 1, Количество / КоличествоУпаковок);
	Возврат ?(ОтЦеныSKU, Цена * Коэффициент, Цена / Коэффициент);
КонецФункции

Функция РассчитатьСуммуНДС(СтавкаНДС, Сумма, СуммаВключаетНДС = Истина) Экспорт
	ПроцентНДС = ОбщегоНазначенияВызовСервераПовтИсп.ПроцентСтавкиНДС(СтавкаНДС);
	СуммаНДС = 0;
	Если ПроцентНДС > 0 Тогда
		СуммаНДС = ?(СуммаВключаетНДС, Сумма / (100 + ПроцентНДС) * ПроцентНДС, Сумма / 100 * ПроцентНДС);
	КонецЕсли;
	Возврат Окр(СуммаНДС, 2);
КонецФункции

// Рассчитываем сумму или суммы НДС в строке основания платёжного документа
Процедура РассчитатьСуммуНДСПлатёжногоДокумента(СтрОснованиеПлатежа) Экспорт
	Если СтрОснованиеПлатежа.НесколькоСтавокНДС Тогда
		МасРасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(СтрОснованиеПлатежа.РасшифровкаНДС, Ложь);
		СуммаИсходная = 0;
		Для Каждого Стр Из МасРасшифровкаНДС Цикл
			СуммаИсходная = СуммаИсходная + Стр.СуммаСНДС;
		КонецЦикла;
		Коэффициент = ?(СуммаИсходная = 0, 1, СтрОснованиеПлатежа.Сумма / СуммаИсходная);
		СтрОснованиеПлатежа.СуммаНДС = 0;
		СуммаОстаток = СтрОснованиеПлатежа.Сумма;
		Для А = 1 По МасРасшифровкаНДС.Количество() Цикл
			СтрНДС = МасРасшифровкаНДС[А - 1];
			СтрНДС.СуммаСНДС = ?(А = МасРасшифровкаНДС.Количество(), СуммаОстаток, Окр(СтрНДС.СуммаСНДС * Коэффициент, 2));
			СтавкаНДС = XMLЗначение(Тип("СправочникСсылка.СтавкиНДС"), СтрНДС.СтавкаНДС);
			СтрНДС.СуммаНДС = РассчитатьСуммуНДС(СтавкаНДС, СтрНДС.СуммаСНДС, Истина);
			СтрОснованиеПлатежа.СуммаНДС = СтрОснованиеПлатежа.СуммаНДС + СтрНДС.СуммаНДС;
			СуммаОстаток = СуммаОстаток - СтрНДС.СуммаСНДС;
		КонецЦикла;
		СтрОснованиеПлатежа.РасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьВJSON(МасРасшифровкаНДС);
	Иначе
		СтрОснованиеПлатежа.СуммаНДС = РассчитатьСуммуНДС(СтрОснованиеПлатежа.СтавкаНДС, СтрОснованиеПлатежа.Сумма, Истина);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСледующийКодСтроки(ТЧ) Экспорт
	Результат = 0;
	Для Каждого Стр Из ТЧ Цикл
		Результат = Макс(Результат, Стр.КодСтроки);
	КонецЦикла;
	Возврат Результат + 1;
КонецФункции

#КонецОбласти

#Область Проверки

Функция ЕстьРеквизит(Объект, ИмяРеквизита) Экспорт
	Структура = Новый Структура(ИмяРеквизита, Неопределено);
	ЗаполнитьЗначенияСвойств(Структура, Объект);
	Возврат Структура[ИмяРеквизита] <> Неопределено;
КонецФункции

#КонецОбласти

#Область Номенклатура

Процедура УстановитьПараметрыНоменклатуры(Стр, Объект, БезЦен = Ложь) Экспорт
	ЦенаВключаетНДС = ЦенаВключаетНДСДокумента(Объект);
	СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект);
	ОбщегоНазначенияВызовСервера.ПолучитьДанныеНоменклатуры(СтрСтруктура, БезЦен, ЦенаВключаетНДС, Истина);
	ЗаполнитьЗначенияСвойств(Стр, СтрСтруктура);
	РассчитатьСтроку(Стр, ЦенаВключаетНДС);
КонецПроцедуры

Процедура УстановитьПараметрыНоменклатурыКонтрагента(Стр, Объект, ТЗЦены = Неопределено) Экспорт
	СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект);
	ОбщегоНазначенияВызовСервера.ПолучитьДанныеНоменклатурыКонтрагента(СтрСтруктура, ТЗЦены);
	ЗаполнитьЗначенияСвойств(Стр, СтрСтруктура);
	РассчитатьСтроку(Стр, ЦенаВключаетНДСДокумента(Объект));
КонецПроцедуры

Процедура УстановитьЦенуНоменклатуры(Стр, Объект) Экспорт
	ЦенаВключаетНДС = ЦенаВключаетНДСДокумента(Объект);
	СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект);
	ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры(СтрСтруктура, , ЦенаВключаетНДС);
	ЗаполнитьЗначенияСвойств(Стр, СтрСтруктура);
	РассчитатьСтроку(Стр, ЦенаВключаетНДС);
КонецПроцедуры

Процедура ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара = Неопределено, ИмяТЧ = "ТЧТовары", ВидЦены = Неопределено, Форма = Неопределено, ТекстОшибки = "") Экспорт
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда Возврат КонецЕсли;
	Если СтруктураТОвара = Неопределено Тогда
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	КонецЕсли;
	Если СтруктураТОвара = Неопределено Тогда
		ТекстОшибки = Нстр("fr = 'Erreur ('; ru = 'Ошибка ('; en = 'Error ('; es = 'Error ('") + Штрихкод + Нстр("fr = '); contacter l''administrateur!'; ru = '); обратитесь к администратору!'; en = '); contact the administrator!'; es = '); ¡póngase en contacto con el administrador!'");
		Возврат;
	КонецЕсли;
	ЦенаВключаетНДС = ЦенаВключаетНДСДокумента(Объект);
	Мас = Объект[ИмяТЧ].НайтиСтроки(СтруктураТОвара);
	Если Мас.Количество() = 0 Тогда
		НС = Объект[ИмяТЧ].Добавить();
		ЗаполнитьЗначенияСвойств(НС,СтруктураТОвара);
		Если Не ВидЦены = Неопределено и ЕстьРеквизит(НС, "ВидЦены") Тогда
			НС.ВидЦены = ВидЦены;
		КонецЕсли;
		СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(НС, Объект);
		ОбщегоНазначенияВызовСервера.ПолучитьДанныеНоменклатуры(СтрСтруктура, , ЦенаВключаетНДС, Истина);
		ЗаполнитьЗначенияСвойств(НС,СтрСтруктура);
		Если ЕстьРеквизит(НС, "КоличествоУпаковок") Тогда
			НС.КоличествоУпаковок = 1;
		ИначеЕсли ЕстьРеквизит(НС, "Количество") Тогда
			НС.Количество = 1;
		КонецЕсли;
	Иначе
		НС = Мас.Получить(0);
		Если ЕстьРеквизит(НС, "КоличествоУпаковок") Тогда
			НС.КоличествоУпаковок = НС.КоличествоУпаковок + 1;
		ИначеЕсли ЕстьРеквизит(НС, "Количество") Тогда
			НС.Количество = НС.Количество + 1;
		КонецЕсли;
	КонецЕсли;
	РассчитатьСтроку(НС, ЦенаВключаетНДС);
	Если Не Форма = Неопределено Тогда
		Форма.Элементы[ИмяТЧ].ТекущаяСтрока = НС.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

// Добавляет в табличную часть строку по результату подбора (см. Справочник.Номенклатура.Форма.ФормаПодбора):
// новая строка с ценой по документу или увеличение количества существующей строки того же товара.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - документ.
//  СтруктураТовара - Структура - Номенклатура, Количество и, необязательно, Характеристика.
//  ИмяТЧ - Строка - имя табличной части.
//  ВидЦены - СправочникСсылка.ВидыЦен, Неопределено - вид цены для новой строки.
//  Форма - ФормаКлиентскогоПриложения, Неопределено - форма для позиционирования на строке.
//
Процедура ДобавитьНоменклатуруПоПодбору(Объект, СтруктураТовара, ИмяТЧ = "ТЧТовары", ВидЦены = Неопределено,
	Форма = Неопределено) Экспорт
	ЦенаВключаетНДС = ЦенаВключаетНДСДокумента(Объект);
	Количество = СтруктураТовара.Количество;
	НС = СтрокаДляПодбора(Объект, СтруктураТовара, ИмяТЧ, ВидЦены, ЦенаВключаетНДС);
	Если ЕстьРеквизит(НС, "КоличествоУпаковок") Тогда
		НС.КоличествоУпаковок = НС.КоличествоУпаковок + Количество;
	ИначеЕсли ЕстьРеквизит(НС, "Количество") Тогда
		НС.Количество = НС.Количество + Количество;
	Иначе
		Возврат;
	КонецЕсли;
	РассчитатьСтроку(НС, ЦенаВключаетНДС);
	Если Не Форма = Неопределено Тогда
		Форма.Элементы[ИмяТЧ].ТекущаяСтрока = НС.ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

// Находит в табличной части строку того же товара (и характеристики, если она выбрана
// в подборе) или добавляет новую строку с данными номенклатуры.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - документ.
//  СтруктураТовара - Структура - Номенклатура и, необязательно, Характеристика.
//  ИмяТЧ - Строка - имя табличной части.
//  ВидЦены - СправочникСсылка.ВидыЦен, Неопределено - вид цены для новой строки.
//  ЦенаВключаетНДС - Булево - режим НДС документа.
//
// Возвращаемое значение:
//  ДанныеФормыЭлементКоллекции - строка табличной части
//
Функция СтрокаДляПодбора(Объект, СтруктураТовара, ИмяТЧ, ВидЦены, ЦенаВключаетНДС)
	ИмяХарактеристики = "Характеристика";
	Характеристика = Неопределено;
	СтруктураТовара.Свойство(ИмяХарактеристики, Характеристика);
	Отбор = Новый Структура("Номенклатура", СтруктураТовара.Номенклатура);
	Если ЗначениеЗаполнено(Характеристика) И Объект[ИмяТЧ].Количество() > 0
		И ЕстьРеквизит(Объект[ИмяТЧ][0], ИмяХарактеристики) Тогда
		Отбор.Вставить(ИмяХарактеристики, Характеристика);
	КонецЕсли;
	Мас = Объект[ИмяТЧ].НайтиСтроки(Отбор);
	Если Мас.Количество() > 0 Тогда
		Возврат Мас.Получить(0);
	КонецЕсли;
	НС = Объект[ИмяТЧ].Добавить();
	НС.Номенклатура = СтруктураТовара.Номенклатура;
	Если ЗначениеЗаполнено(Характеристика) И ЕстьРеквизит(НС, ИмяХарактеристики) Тогда
		НС[ИмяХарактеристики] = Характеристика;
	КонецЕсли;
	Если ЕстьРеквизит(НС, "КодСтроки") Тогда
		НС.КодСтроки = ПолучитьСледующийКодСтроки(Объект[ИмяТЧ]);
	КонецЕсли;
	Если Не ВидЦены = Неопределено И ЕстьРеквизит(НС, "ВидЦены") Тогда
		НС.ВидЦены = ВидЦены;
	КонецЕсли;
	СтрСтруктура = ПреобразоватьСтрокуТаблицыВСтруктуру(НС, Объект);
	ОбщегоНазначенияВызовСервера.ПолучитьДанныеНоменклатуры(СтрСтруктура, , ЦенаВключаетНДС, Истина);
	ЗаполнитьЗначенияСвойств(НС, СтрСтруктура);
	Возврат НС;
КонецФункции

// Режим НДС документа: реквизит ЦенаВключаетНДС, а если его нет - цены с НДС.
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормыСтруктура - документ.
//
// Возвращаемое значение:
//  Булево
//
Функция ЦенаВключаетНДСДокумента(Объект) Экспорт
	Возврат ?(ЕстьРеквизит(Объект, "ЦенаВключаетНДС"), Объект.ЦенаВключаетНДС, Истина);
КонецФункции

#КонецОбласти

#Область Денежные_документы

Процедура ДобавитьОснованиеВДенежныйДокумент(ДокОбъект, Основание) Экспорт
	НС = ДокОбъект.ТЧОснования.Добавить();
	НС.Основание = Основание;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(Основание,
		РаботаСВалютамиКлиентСервер.ВалютаПлатежа(ДокОбъект));
	ЗаполнитьЗначенияСвойств(НС, ДанныеСуммы);
КонецПроцедуры

#КонецОбласти

#Область Разное

Процедура УстановитьТипЗначенияПоля(Элемент, Реквизит, ОписаниеТипов) Экспорт
	Если ОписаниеТипов.СодержитТип(ТипЗнч(Реквизит)) Тогда Возврат КонецЕсли;
	Элемент.ОграничениеТипа = ОписаниеТипов;
	Реквизит = ОписаниеТипов.ПривестиЗначение();
КонецПроцедуры

// Валюта и курс документа в валюте - для пересчёта цен видов цен (ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры).
//
// Параметры:
//  Результат - Структура - строка документа (см. ПреобразоватьСтрокуТаблицыВСтруктуру).
//  Объект - ДанныеФормыСтруктура, ДокументОбъект - документ.
//
Процедура ДобавитьВалютуДокумента(Результат, Объект)
	Если ЕстьРеквизит(Объект, "ВВалюте") И Объект.ВВалюте Тогда
		Результат.Вставить("ВалютаДокумента", Объект.Валюта);
		Результат.Вставить("КурсДокумента", Объект.КурсВалюты);
	КонецЕсли;
КонецПроцедуры

Функция ПреобразоватьСтрокуТаблицыВСтруктуру(Стр, Объект) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Стр.Номенклатура);
	Результат.Вставить("Характеристика", Стр.Характеристика);
	Результат.Вставить("Упаковка", Стр.Упаковка);
	Если ЕстьРеквизит(Стр, "КоличествоУпаковок") Тогда
		Результат.Вставить("КоличествоУпаковок", Стр.КоличествоУпаковок);
		Результат.Вставить("Количество", Стр.Количество);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "НоменклатураКонтрагента") Тогда
		Результат.Вставить("НоменклатураКонтрагента", Стр.НоменклатураКонтрагента);
		Если ЕстьРеквизит(Объект, "Контрагент") Тогда
			Результат.Вставить("Поставщик", Объект.Контрагент);
		КонецЕсли;
	ИначеЕсли ЕстьРеквизит(Объект, "Ссылка") Тогда
		Если  ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
			Результат.Вставить("Поставщик", Неопределено);
		КонецЕсли;
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "СтавкаНДС") Тогда
		Результат.Вставить("СтавкаНДС", Стр.СтавкаНДС);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "СуммаНДС") Тогда
		Результат.Вставить("СуммаНДС", Стр.СуммаНДС);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "ВидЦены") Тогда
		Результат.Вставить("ВидЦены", Стр.ВидЦены);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "Цена") Тогда
		Результат.Вставить("Цена", Стр.Цена);
		Результат.Вставить("ДатаЦены", ?(ЕстьРеквизит(Объект, "Дата"), КонецДня(Объект.Дата), ТекущаяДата()));
		Если ЕстьРеквизит(Стр, "ЦенаSKU") Тогда
			Результат.Вставить("ЦенаSKU", Стр.ЦенаSKU);
		КонецЕсли;
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "ЦенаМинимальная") Тогда
		Результат.Вставить("ЦенаМинимальная", Стр.ЦенаМинимальная);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "ЦенаРозничная") Тогда
		Результат.Вставить("ЦенаРозничная", Стр.ЦенаРозничная);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "Сумма") Тогда
		Результат.Вставить("Сумма", Стр.Сумма);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "СуммаСНДС") Тогда
		Результат.Вставить("СуммаСНДС", Стр.СуммаСНДС);
	КонецЕсли;
	Если ЕстьРеквизит(Стр, "Организация") Тогда
		Результат.Вставить("Организация", Стр.Организация);
	КонецЕсли;
	ДобавитьВалютуДокумента(Результат, Объект);
	Если ЕстьРеквизит(Объект, "ТипЦеныПоТипуЦен") и ЕстьРеквизит(Стр, "ЦенаПоТипуЦен") Тогда
		Результат.Вставить("ТипЦеныПоТипуЦен", Объект.ТипЦеныПоТипуЦен);
		Результат.Вставить("ЦенаПоТипуЦен", Стр.ЦенаПоТипуЦен);
	КонецЕсли;
	Если Не Результат.Свойство("Поставщик") Тогда
		ВставитьРеквизитЕслиЕсть(Результат, Объект, "Контрагент");
	КонецЕсли;
	ВставитьРеквизитЕслиЕсть(Результат, Объект, "МестоХранения");
	ВставитьРеквизитЕслиЕсть(Результат, Стр, "Остаток");
	ВставитьРеквизитЕслиЕсть(Результат, Стр, "ЦенаЗакупкиПоследняя");
	ВставитьРеквизитЕслиЕсть(Результат, Стр, "ЦенаПродажиПоследняя");
	ВставитьРеквизитЕслиЕсть(Результат, Стр, "ПроцентНаценкиНаЦену");
	Возврат Результат;
КонецФункции

// Вставляет в структуру значение реквизита источника, если реквизит у источника есть.
//
// Параметры:
//  Результат - Структура - структура, в которую добавляется свойство.
//  Источник - ДокументОбъект, СтрокаТабличнойЧасти, ДанныеФормыСтруктура - откуда берётся значение.
//  ИмяРеквизита - Строка - имя реквизита источника и свойства результата.
//
Процедура ВставитьРеквизитЕслиЕсть(Результат, Источник, ИмяРеквизита)
	Если ЕстьРеквизит(Источник, ИмяРеквизита) Тогда
		Результат.Вставить(ИмяРеквизита, Источник[ИмяРеквизита]);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораВидовЦен(ОсновнойВидЦены, ЭлементФормы) Экспорт
	ВидЦеныРозничная = ПредопределенноеЗначение("Справочник.ВидыЦен.Розничная");
	ЭлементФормы.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(ОсновнойВидЦены) Тогда
		ЭлементФормы.СписокВыбора.Добавить(ОсновнойВидЦены);
	КонецЕсли;
	Если ОсновнойВидЦены <> ВидЦеныРозничная Тогда
		ЭлементФормы.СписокВыбора.Добавить(ВидЦеныРозничная);
	КонецЕсли;
	ЭлементФормы.СписокВыбора.Добавить(Неопределено, Нстр("fr = '<Arbitraire>'; ru = '<Произвольная>'; en = '\u003cArbitrary\u003e'; es = '\u003cArbitraria\u003e'"));
КонецПроцедуры

Процедура УстановитьПараметрыФункциональныхОпций(Форма) Экспорт
	Структура = Новый Структура("Организация, МестоХранения", Неопределено, Неопределено);
	СтруктураОбъект = Новый Структура("Объект", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураОбъект, Форма);
	Если СтруктураОбъект.Объект = Неопределено Тогда // По реквизитам формы
		ЗаполнитьЗначенияСвойств(Структура, Форма);
	Иначе // По реквизитам объекта
		ЗаполнитьЗначенияСвойств(Структура, Форма.Объект);
	КонецЕсли;
	// Удалим неопределённые
	Если Структура.Количество() > 0 Тогда
		Форма.УстановитьПараметрыФункциональныхОпцийФормы(Структура);
	КонецЕсли;
	НастроитьВидимостьБазовойЕдиницы(Форма);
КонецПроцедуры

// Показывает надпись базовой единицы номенклатуры в табличной части только тогда, когда выключена
// функциональная опция «ИспользоватьУпаковку». При включённой опции в той же ячейке показывается
// поле «Упаковка» (реквизит входит в состав опции), и надпись дублировала бы его.
//
// Дубль раньше снимался условным оформлением «Текст = пусто» по условию «Упаковка заполнена». Так
// делать нельзя: параметр «Текст» применяется к ячейке колонки целиком и стирает вместе с надписью
// значение соседнего поля «Упаковка» - колонка «Единица» оказывалась пустой во всех документах
// (дефект 2026-09-24, платформа 8.5). Видимость - свойство самого элемента и на соседа не влияет.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма с табличной частью товаров.
//
Процедура НастроитьВидимостьБазовойЕдиницы(Форма) Экспорт
	// ПолучитьФункциональнуюОпцию тонкому клиенту недоступна, а модуль клиент-серверный и
	// проверяется платформой и под него: прямой вызов ронял проверку конфигурации - «процесс или
	// функция с указанным именем не определена (ПолучитьФункциональнуюОпцию)», проверка тонкого
	// клиента. Настраивать надпись нужно только там, где форма создаётся, то есть на сервере:
	// опция «ИспользоватьУпаковку» в течение сеанса не меняется, и клиентские вызовы
	// УстановитьПараметрыФункциональныхОпций (переустановка параметров при смене организации или
	// места хранения) на эту видимость не влияют - она уже выставлена при создании формы.
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	ПоказыватьБазовуюЕдиницу = Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковку");
	Для Каждого Элемент Из Форма.Элементы Цикл
		// Проверка типа обязательна: Форма.Элементы отдаёт и группы, и декорации, и кнопки,
		// у которых свойства ПутьКДанным нет.
		Если ТипЗнч(Элемент) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтоНадписьБазовойЕдиницы(Элемент) Тогда
			Элемент.Видимость = ПоказыватьБазовуюЕдиницу;
		КонецЕсли;
	КонецЦикла;
#КонецЕсли
КонецПроцедуры

// Признак того, что поле - надпись базовой единицы, стоящая в одной ячейке с полем упаковки.
//
// Отбор идёт по устройству колонки, а не по имени элемента: имена в формах разные
// (ТЧТоварыЕдиница, ТЧГотоваяПродукцияЕдиница, ТЧТоварыЕдиницаОприходование, Единица), а путь к
// данным ведёт через разные реквизиты строки (Номенклатура, НоменклатураОприходование).
// Пара «поле упаковки + надпись» в группе колонок «в ячейке» - как раз тот случай, где надпись
// дублирует упаковку. Одинокая надпись единицы (УстановкаЦенНоменклатуры) и надпись отдельной
// колонкой (техкарта в форме номенклатуры) под условие не подходят и остаются видимыми.
//
// Параметры:
//  Элемент - ПолеФормы - проверяемое поле формы.
//
// Возвращаемое значение:
//  Булево - Истина, если поле - надпись базовой единицы в паре с полем упаковки.
//
Функция ЭтоНадписьБазовойЕдиницы(Элемент)
	Если Не СтрЗаканчиваетсяНа(Элемент.ПутьКДанным, ".Единица") Тогда
		Возврат Ложь;
	КонецЕсли;
	Родитель = Элемент.Родитель;
	Если ТипЗнч(Родитель) <> Тип("ГруппаФормы") Тогда
		Возврат Ложь;
	КонецЕсли;
	ПолеУпаковки = Неопределено;
	Для Каждого Сосед Из Родитель.ПодчиненныеЭлементы Цикл
		Если Сосед.Имя = Элемент.Имя Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Сосед) = Тип("ПолеФормы") И СтрНайти(Сосед.ПутьКДанным, ".Упаковка") > 0 Тогда
			ПолеУпаковки = Сосед;
		Иначе
			// В ячейке есть что-то ещё - это не пара «упаковка + базовая единица».
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат ПолеУпаковки <> Неопределено;
КонецФункции

Процедура УдалитьСвязанныеСтроки(Объект, ИмяТаблицы, Идентификатор) Экспорт
	Если ТипЗнч(Идентификатор) = Тип("Число") Тогда
		Отбор = Новый Структура("КодСтроки", Идентификатор);
	ИначеЕсли ТипЗнч(Идентификатор) = Тип("УникальныйИдентификатор") Тогда
		Отбор = Новый Структура("ID", Идентификатор);
	КонецЕсли;
	МасУдаление = Объект[ИмяТаблицы].НайтиСтроки(Отбор);
	Для А = 1 - МасУдаление.Количество() По 0 Цикл
		Объект[ИмяТаблицы].Удалить(МасУдаление[-А]);
	КонецЦикла;
КонецПроцедуры

// Параметры выборки ссылок одной страницы списка.
//
// Последняя страница читается с конца - обратным порядком и ровно на свой остаток строк: прямая
// выборка «ПЕРВЫЕ НомерСтраницы * РазмерСтраницы» на ней вытянула бы весь журнал ради полусотни
// строк. Порядок ссылок в отборе роли не играет: список выстраивает их своим порядком.
//
// Параметры:
//  НомерСтраницы  - Число - текущая страница, нумерация с единицы
//  ВсегоСтраниц   - Число - число страниц, не меньше единицы
//  РазмерСтраницы - Число - сколько строк списка помещается на странице
//  ВсегоЗаписей   - Число - строк в списке с учётом отборов
//
// Возвращаемое значение:
//  Структура - КоличествоСтрок (Число) - сколько строк читать запросом;
//              Порядок (Строка) - текст предложения УПОРЯДОЧИТЬ ПО по псевдониму Док;
//              НачальныйИндекс (Число) - с какого индекса брать ссылки страницы из выборки.
//
Функция ПараметрыВыборкиСтраницы(НомерСтраницы, ВсегоСтраниц, РазмерСтраницы, ВсегоЗаписей) Экспорт

	Параметры = Новый Структура("КоличествоСтрок, Порядок, НачальныйИндекс");

	Если НомерСтраницы = ВсегоСтраниц Тогда
		Параметры.КоличествоСтрок = ВсегоЗаписей - (ВсегоСтраниц - 1) * РазмерСтраницы;
		Параметры.Порядок = "Док.Дата ВОЗР,
			|	Док.Ссылка УБЫВ";
		Параметры.НачальныйИндекс = 0;
	Иначе
		Параметры.КоличествоСтрок = НомерСтраницы * РазмерСтраницы;
		Параметры.Порядок = "Док.Дата УБЫВ,
			|	Док.Ссылка";
		Параметры.НачальныйИндекс = (НомерСтраницы - 1) * РазмерСтраницы;
	КонецЕсли;

	Возврат Параметры;

КонецФункции

// Обновляет пагинатор формы списка: надписи страницы и записей, доступность кнопок перехода.
//
// Форма обязана содержать элементы пагинатора: надписи НадписьСтраницы и НадписьЗаписей,
// кнопки КнопкаСтраницаПервая, КнопкаСтраницаНазад, КнопкаСтраницаВперед, КнопкаСтраницаПоследняя.
//
// Параметры:
//  Форма          - ФормаКлиентскогоПриложения - форма списка с группой пагинации
//  НомерСтраницы  - Число - текущая страница, нумерация с единицы
//  ВсегоСтраниц   - Число - число страниц, не меньше единицы
//  РазмерСтраницы - Число - сколько строк списка помещается на странице
//  ВсегоЗаписей   - Число - строк в списке с учётом отборов
//
Процедура ОбновитьПагинатор(Форма, НомерСтраницы, ВсегоСтраниц, РазмерСтраницы, ВсегоЗаписей) Экспорт

	Элементы = Форма.Элементы;

	Элементы.НадписьСтраницы.Заголовок = СтрШаблон("%1 / %2", НомерСтраницы, ВсегоСтраниц);
	Элементы.НадписьЗаписей.Заголовок = ПредставлениеЗаписейСтраницы(НомерСтраницы, РазмерСтраницы, ВсегоЗаписей);

	ЕстьПредыдущая = НомерСтраницы > 1;
	ЕстьСледующая = НомерСтраницы < ВсегоСтраниц;

	УстановитьДоступностьКнопкиСтраницы(Элементы.КнопкаСтраницаПервая, ЕстьПредыдущая);
	УстановитьДоступностьКнопкиСтраницы(Элементы.КнопкаСтраницаНазад, ЕстьПредыдущая);
	УстановитьДоступностьКнопкиСтраницы(Элементы.КнопкаСтраницаВперед, ЕстьСледующая);
	УстановитьДоступностьКнопкиСтраницы(Элементы.КнопкаСтраницаПоследняя, ЕстьСледующая);

КонецПроцедуры

// Устанавливает доступность кнопки пагинатора и её важность: доступная кнопка цветная,
// недоступная - блёклая (правило владельца 2026-10-06). Важность меняется вместе с доступностью,
// потому что одна доступность в интерфейсе 8.5 кнопки визуально не различает.
//
// Параметры:
//  Кнопка   - КнопкаФормы - кнопка перехода по страницам
//  Доступна - Булево - есть ли страница, на которую ведёт кнопка
//
Процедура УстановитьДоступностьКнопкиСтраницы(Кнопка, Доступна)

	Кнопка.Доступность = Доступна;
	Кнопка.Важность = ?(Доступна, ВажностьКнопки.Главная, ВажностьКнопки.Дополнительная);

КонецПроцедуры

// Представление диапазона записей, показанных на текущей странице списка.
//
// Параметры:
//  НомерСтраницы  - Число - текущая страница, нумерация с единицы
//  РазмерСтраницы - Число - сколько строк списка помещается на странице
//  ВсегоЗаписей   - Число - строк в списке с учётом отборов
//
// Возвращаемое значение:
//  Строка - «1-50 из 124» либо «Нет записей», когда список пуст.
//
Функция ПредставлениеЗаписейСтраницы(НомерСтраницы, РазмерСтраницы, ВсегоЗаписей)

	Если ВсегоЗаписей = 0 Тогда
		Возврат НСтр("ru = 'Нет записей'; fr = 'Aucun enregistrement';
			|en = 'No records'; es = 'Sin registros'");
	КонецЕсли;

	Первая = (НомерСтраницы - 1) * РазмерСтраницы + 1;
	Последняя = Мин(НомерСтраницы * РазмерСтраницы, ВсегоЗаписей);

	Шаблон = НСтр("ru = '%1-%2 из %3'; fr = '%1-%2 sur %3';
		|en = '%1-%2 of %3'; es = '%1-%2 de %3'");

	Возврат СтрШаблон(Шаблон, Первая, Последняя, ВсегоЗаписей);

КонецФункции

#КонецОбласти

#Область Даты

Функция ДобавитьДень(ДатаИсходная, КоличествоДней) Экспорт
	Возврат ДатаИсходная + КоличествоДней * (60 * 60 * 24);
КонецФункции

#КонецОбласти
